app/controllers/v1/greetings_controller.rb

  def create
    greeting = Greeting.new(greetingmessage:params[:greetingmessage])
    if greeting.save
---
INSERT INTO "greetings" ("greetingmessage", "string", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["greetingmessage", nil], ["string", nil], ["created_at", "2022-06-24 21:35:30.996648"], ["updated_at", "2022-06-24 21:35:30.996648"]]